# Query a pandas DataFrame 

Returning a portion of the data in a DataFrame is called *slicing* or *dicing* the data.  
There are many different ways to query a pandas DataFrame, here are a few to get you started

In [1]:
import pandas as pd

In [2]:
airports = pd.DataFrame([
                        ['Seatte-Tacoma', 'Seattle', 'USA'],
                        ['Dulles', 'Washington', 'USA'],
                        ['London Heathrow', 'London', 'United Kingdom'],
                        ['Schiphol', 'Amsterdam', 'Netherlands'],
                        ['Changi', 'Singapore', 'Singapore'],
                        ['Pearson', 'Toronto', 'Canada'],
                        ['Narita', 'Tokyo', 'Japan']
                        ],
                        columns = ['Name', 'City', 'Country']
                        )
airports

              Name        City         Country
0    Seatte-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London Heathrow      London  United Kingdom
3         Schiphol   Amsterdam     Netherlands
4           Changi   Singapore       Singapore
5          Pearson     Toronto          Canada
6           Narita       Tokyo           Japan

## Return one column

Specify the name of the column you want to return
- `DataFrame['columnName']`

In [3]:
airports['City']

0       Seattle
1    Washington
2        London
3     Amsterdam
4     Singapore
5       Toronto
6         Tokyo
Name: City, dtype: object

## Return multiple columns

Provide a list of the columns you want to return
- `DataFrame[['FirstColumn','SecondColumn']]`

In [4]:
airports[['Name', 'Country']]

              Name         Country
0    Seatte-Tacoma             USA
1           Dulles             USA
2  London Heathrow  United Kingdom
3         Schiphol     Netherlands
4           Changi       Singapore
5          Pearson          Canada
6           Narita           Japan

## Using *iloc*

`iloc[row, column]` allows you to access a group of rows or columns by row and column index positions.  
You specify the specific row and column you want returned:
- First row is row 0
- First column is column 0

In [5]:
# Return the value in the first row, first column
airports.iloc[0,0]

'Seatte-Tacoma'

In [6]:
# Return the value in the third row, third column
airports.iloc[2,2]

'United Kingdom'

In [7]:
# Using : returns all rows or all columns
airports.iloc[:,:]

              Name        City         Country
0    Seatte-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London Heathrow      London  United Kingdom
3         Schiphol   Amsterdam     Netherlands
4           Changi   Singapore       Singapore
5          Pearson     Toronto          Canada
6           Narita       Tokyo           Japan

You can request a range of rows or a range of columns
- `[x:y]` will return rows or columns x through y

In [8]:
# Return the first two rows and display all columns 
airports.iloc[0:2,:]

            Name        City Country
0  Seatte-Tacoma     Seattle     USA
1         Dulles  Washington     USA

In [9]:
# Return all rows and display the first two columns
airports.iloc[:,0:2]

              Name        City
0    Seatte-Tacoma     Seattle
1           Dulles  Washington
2  London Heathrow      London
3         Schiphol   Amsterdam
4           Changi   Singapore
5          Pearson     Toronto
6           Narita       Tokyo

You can request a list of rows or a list of columns
- `[x,y,z]` will return rows or columns x, y & z

In [10]:
airports.iloc[:,[0,2]]

              Name         Country
0    Seatte-Tacoma             USA
1           Dulles             USA
2  London Heathrow  United Kingdom
3         Schiphol     Netherlands
4           Changi       Singapore
5          Pearson          Canada
6           Narita           Japan

## Using *loc* to specify columns by name

If you want to list the column names instead of the column positions use **loc** instead of **iloc**

In [11]:
airports.loc[:,['Name', 'Country']]

              Name         Country
0    Seatte-Tacoma             USA
1           Dulles             USA
2  London Heathrow  United Kingdom
3         Schiphol     Netherlands
4           Changi       Singapore
5          Pearson          Canada
6           Narita           Japan